<?php

header('Location: ./gift/');



/*
●個人介紹

從資策會－前端就業養成班畢業，對於前端技術及程式開發充滿熱忱，前端的技術像似無窮無盡，但也可以說是一種闖關遊戲，學好一種技術接著向下一關邁進。

我的興趣是做手工藝，對我來說跟寫程式有點相像，親手一點一滴的製作，途中也會遇到一些難題需要思考怎麼解決，這樣子從無到有的過程，都讓我非常有成就感。

●專業訓練歷程

在資策會結訓前，需要與組員一起開發一個電商網站，我負責了網站的優惠券及廣告的部分，前端使用了 React 的框架，也包含了 React Redux 來管理資料，後端則是用了 Node.js 來串接資料庫，也使用了 Git 做版本控制，學程式最大的收穫就是思維的改變，會先拆解目標或是問題，接著步驟化、規劃流程，再一一去執行，這樣的方式讓效率大幅的提升。 

而團隊合作對於專題也十分重要，各個組員提出自己的意見，若遇到意見不同時，就讓大家對每個提案說出優劣勢，這樣就知道每個人的出發點及想法，溝通上就順利許多，然後思考過後再進行投票，雖然說開發是各自開發，但最後形成的是一個網站，需要大家各司其職並且互相幫助及信賴，才能呈現出一個好的成果。

●工作歷程

實務上遇到問題時，喜歡先自己排查，因為是不喜歡麻煩別人的性格，能自己解決的都想自己處理，當然也會先評估問題的重要性及緊急性，維護公司系統時，除了解決錯誤外，也會把產生問題的原因釐清並且排除，以防下一次再發生，

工作初期接手問題時，會把程式碼從頭讀一遍，釐清程式邏輯架構後，再開始找出問題點，後來自覺太花費時間，改成了會先從錯誤地方開始延伸找出問題點，出錯的地方可能只是某一區塊而已，



閒暇時會看日本輕小說，為了自己方便看，自學了python使用爬蟲把網頁上的文字翻譯後抓下成txt

改原始碼?、python?

*/
?>
